espressif/esp-port-for-amazon-kvs-sdk/examples/webrtc_person_detect/sdkconfig.defaults
# Streaming only defaults to P4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../common_components/app_common/partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

#
# ESP32-Specific
#
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

#
# ESP-TLS
#
CONFIG_ESP_TLS_USING_MBEDTLS=y

#
# SPI RAM config
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_WIFI_LWIP_ALLOCATION_FROM_SPIRAM_FIRST=y

CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_BANKSWITCH_ENABLE=y
CONFIG_SPIRAM_BANKSWITCH_RESERVE=8
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP32_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP32_WIFI_STATIC_TX_BUFFER_NUM=16

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_ANSI_OEM=y
CONFIG_FATFS_FS_LOCK=10

CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y

CONFIG_LOG_DEFAULT_LEVEL=3

#
# SNTP
#
CONFIG_LWIP_SNTP_MAX_SERVERS=3

#
# LWIP
#
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
CONFIG_LWIP_L2_TO_L3_COPY=y

#
# mbedTLS
#
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

#CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
#CONFIG_SEMIHOSTFS_HOST_PATH_MAX_LEN=128

CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_ALPN=y

# mbedtls dynamic buffer for memory optimization
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y

CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH=n
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y

#
# ESP Ringbuf
#
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y

#
# FreeRTOS
#
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=4096

#
# ESP System Settings
#
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y

#
# PThreads
#
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8000
CONFIG_PTHREAD_STACK_MIN=4096


CONFIG_MAIN_TASK_STACK_SIZE=8192
CONFIG_IPC_TASK_STACK_SIZE=1024
CONFIG_TIMER_TASK_STACK_SIZE=3584

CONFIG_MB_SERIAL_TASK_STACK_SIZE=2048
CONFIG_SUPPORT_STATIC_ALLOCATION=y

#
# Wi-Fi
#
# CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_IRAM_OPT=n
CONFIG_ESP32_WIFI_RX_IRAM_OPT=n

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_FREERTOS_HZ=1000


#
# BLE Provisioning
#
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_APP_NETWORK_PROV_BLE=y

#
# KVS WebRTC options
#
CONFIG_PREFER_DYNAMIC_ALLOCS=y
CONFIG_USE_ESP_WEBSOCKET_CLIENT=y

#
# Websockets
#
CONFIG_WS_BUFFER_SIZE=2048
CONFIG_WS_DYNAMIC_BUFFER=y

# Since we use esp_video, which needs latest I2C driver
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

#
# esp_hosted: on P4 the GDMA can reach PSRAM through cache, so let the SDIO
# transport buffer mempool allocate from DMA-capable SPIRAM first (falls back
# to internal DMA RAM). Without this the internal-DMA-only alloc fails at boot
# (sdio_mempool_create assert) — the P4 has little spare internal RAM.
#
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y

#
# MDNS Memory Configuration
#
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y

#
# esp-video and isp config
#
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ISP_PIPELINE_CONTROLLER_TASK_STACK_USE_PSRAM=y

# In-system C6/C5 flashing is opt-in per P4 board overlay (p4_eye / p4x_eye /
# p4_c5_core_board). Off by default so single-chip and base P4 builds don't
# expect a slave partition or staged co-processor images.
# CONFIG_SLAVE_FLASHER_ENABLE is not set

#
# mbedTLS crypto features KVS WebRTC needs but IDF's minimal mbedtls config
# leaves off — not board-specific, required for every KVS example on IDF v6:
#   - DTLS-SRTP + keying-material export: derive SRTP keys from the DTLS handshake
#   - X509 create: generate the ephemeral DTLS certificate
#
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_KEYING_MATERIAL_EXPORT=y
CONFIG_MBEDTLS_X509_CREATE_C=y

#
# BLE provisioning security v1 (x25519 + PoP); IDF v6 gates the
# NETWORK_PROV_SECURITY_1 enum behind this (default off).
#
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
#
# The operating point this example is tuned for: 720p at 20 fps or better out of the
# encoder, never below 300 kbps, with the two local sinks at 5 fps.
#
# Pinned here rather than left to the Kconfig defaults because the resolution is the one
# knob that changes every other number in this block, and an experiment at 1080p that
# outlives itself in a stale sdkconfig is invisible - nothing warns, the floor silently
# moves to 676 kbps and the encoder stops making 20 fps.
#
# 25 fps, not 30: the OV2710 delivers 25 at 720p and the grabber re-seeds the ladder from
# what the driver actually reports, so 30 here only puts a number in menuconfig that no
# part of the system agrees with.
#
CONFIG_PERSON_DETECT_VIDEO_WIDTH=1280
CONFIG_PERSON_DETECT_VIDEO_HEIGHT=720
CONFIG_PERSON_DETECT_VIDEO_FPS=25

#
# Rate-control floor = the goal's lower bound, and both halves are needed.
#
# FPS_FLOOR clamps EVERY rung's frame rate up to 20, so the ladder's bottom three rungs
# (12 fps as shipped) cannot take the encoder below the goal no matter how congested the
# uplink gets. MIN_MBPS_PER_PX is the bitrate half, scaled by resolution rather than fixed:
# 1280*720 px * 326/1000 = 300441 bps, i.e. exactly the 300 kbps minimum, and the same
# number would give 676 kbps at 1080p without re-tuning.
#
# Against the 1 Mbps ceiling the grabber derives for 720p that leaves rungs L0..L5 usable
# (25 fps @ 1 Mbps down to 20 fps @ 300 kbps); L6 and L7 clamp onto the same floor and
# video_rate_ctrl drops them from the ladder on its own.
#
CONFIG_VIDEO_RATE_CTRL_FPS_FLOOR=20
CONFIG_VIDEO_RATE_CTRL_MIN_MBPS_PER_PX=326

#
# Six camera buffers, of which two are reserved: the loan budget is COUNT - RESERVE, and
# four concurrent borrowers is what this example needs - the encoder sink, the detector,
# the preview, and one in the pump's hand.
#
CONFIG_MEDIA_STREAM_CAM_BUFFER_COUNT=6

# The two local sinks, both at 5 fps. They are rate-gated per sink on the bus, so this is
# independent of what congestion does to the encoder - a throttled uplink costs the
# encoder frames and costs these two nothing.
CONFIG_PERSON_DETECT_FPS=5
CONFIG_PERSON_DETECT_PREVIEW_FPS=5
